In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[-1.33328023, -0.57033934, -0.58451834],
       [-0.57958232,  0.04352402,  0.50200068],
       [-0.75024015,  0.00848286,  0.612477  ],
       [ 0.6719885 ,  1.36406035,  2.17863067]])

In [5]:
data_frame = pd.DataFrame(data)

In [7]:
data_frame #excel verisi gibi gösteriyor

          0         1         2
0 -1.333280 -0.570339 -0.584518
1 -0.579582  0.043524  0.502001
2 -0.750240  0.008483  0.612477
3  0.671988  1.364060  2.178631

In [8]:
type(data_frame)

pandas.core.frame.DataFrame

In [9]:
type(data_frame[0])

pandas.core.series.Series

In [10]:
new_df =pd.DataFrame(data, index=["Serife","Zehra","Ufuk","Umut"],columns=["Salary","Age","Seniority"])

In [11]:
new_df

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477
Umut    0.671988  1.364060   2.178631

In [12]:
new_df["Age"]

Serife   -0.570339
Zehra     0.043524
Ufuk      0.008483
Umut      1.364060
Name: Age, dtype: float64

In [13]:
new_df["Salary"]

Serife   -1.333280
Zehra    -0.579582
Ufuk     -0.750240
Umut      0.671988
Name: Salary, dtype: float64

In [14]:
new_df[["Age","Salary"]]

             Age    Salary
Serife -0.570339 -1.333280
Zehra   0.043524 -0.579582
Ufuk    0.008483 -0.750240
Umut    1.364060  0.671988

In [15]:
new_df.loc["Serife"]

Salary      -1.333280
Age         -0.570339
Seniority   -0.584518
Name: Serife, dtype: float64

In [16]:
new_df.iloc[1]

Salary      -0.579582
Age          0.043524
Seniority    0.502001
Name: Zehra, dtype: float64

In [17]:
new_df

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477
Umut    0.671988  1.364060   2.178631

In [18]:
new_df.iloc[:,2] # :-->tüm rowları sec

Serife   -0.584518
Zehra     0.502001
Ufuk      0.612477
Umut      2.178631
Name: Seniority, dtype: float64

In [19]:
new_df["Extra"] = 10

In [20]:
new_df

          Salary       Age  Seniority  Extra
Serife -1.333280 -0.570339  -0.584518     10
Zehra  -0.579582  0.043524   0.502001     10
Ufuk   -0.750240  0.008483   0.612477     10
Umut    0.671988  1.364060   2.178631     10

In [22]:
new_df.drop("Extra",axis = 1)

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477
Umut    0.671988  1.364060   2.178631

In [23]:
new_df

          Salary       Age  Seniority  Extra
Serife -1.333280 -0.570339  -0.584518     10
Zehra  -0.579582  0.043524   0.502001     10
Ufuk   -0.750240  0.008483   0.612477     10
Umut    0.671988  1.364060   2.178631     10

In [24]:
new_df.drop("Extra",axis=1,inplace=True) #new_df = new_df.drop

In [25]:
new_df

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477
Umut    0.671988  1.364060   2.178631

In [26]:
new_df["Umut"]= 10

In [27]:
new_df

          Salary       Age  Seniority  Umut
Serife -1.333280 -0.570339  -0.584518    10
Zehra  -0.579582  0.043524   0.502001    10
Ufuk   -0.750240  0.008483   0.612477    10
Umut    0.671988  1.364060   2.178631    10

In [28]:
new_df.drop("Umut")

          Salary       Age  Seniority  Umut
Serife -1.333280 -0.570339  -0.584518    10
Zehra  -0.579582  0.043524   0.502001    10
Ufuk   -0.750240  0.008483   0.612477    10

In [29]:
new_df

          Salary       Age  Seniority  Umut
Serife -1.333280 -0.570339  -0.584518    10
Zehra  -0.579582  0.043524   0.502001    10
Ufuk   -0.750240  0.008483   0.612477    10
Umut    0.671988  1.364060   2.178631    10

In [30]:
new_df.drop("Umut", axis=1,inplace=True)

In [31]:
new_df

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477
Umut    0.671988  1.364060   2.178631

In [32]:
new_df.drop("Umut", axis=0)

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477

In [33]:
new_df

          Salary       Age  Seniority
Serife -1.333280 -0.570339  -0.584518
Zehra  -0.579582  0.043524   0.502001
Ufuk   -0.750240  0.008483   0.612477
Umut    0.671988  1.364060   2.178631

In [34]:
new_df.loc["Serife"]

Salary      -1.333280
Age         -0.570339
Seniority   -0.584518
Name: Serife, dtype: float64

In [35]:
new_df.loc["Serife"]["Salary"]

np.float64(-1.3332802330538838)

In [36]:
new_df.loc["Serife","Salary"]

np.float64(-1.3332802330538838)

In [37]:
new_df.loc["Serife","Salary"]=100

In [38]:
new_df

            Salary       Age  Seniority
Serife  100.000000 -0.570339  -0.584518
Zehra    -0.579582  0.043524   0.502001
Ufuk     -0.750240  0.008483   0.612477
Umut      0.671988  1.364060   2.178631

In [39]:
new_df > 0

        Salary    Age  Seniority
Serife    True  False      False
Zehra    False   True       True
Ufuk     False   True       True
Umut      True   True       True

In [40]:
boolean_frame = new_df >0

In [41]:
new_df[boolean_frame]

            Salary       Age  Seniority
Serife  100.000000       NaN        NaN
Zehra          NaN  0.043524   0.502001
Ufuk           NaN  0.008483   0.612477
Umut      0.671988  1.364060   2.178631

In [42]:
new_df[new_df>0]

            Salary       Age  Seniority
Serife  100.000000       NaN        NaN
Zehra          NaN  0.043524   0.502001
Ufuk           NaN  0.008483   0.612477
Umut      0.671988  1.364060   2.178631

In [43]:
new_df[new_df["Salary"]>1]

        Salary       Age  Seniority
Serife   100.0 -0.570339  -0.584518

In [44]:
new_df

            Salary       Age  Seniority
Serife  100.000000 -0.570339  -0.584518
Zehra    -0.579582  0.043524   0.502001
Ufuk     -0.750240  0.008483   0.612477
Umut      0.671988  1.364060   2.178631

In [45]:
new_df.reset_index()

    index      Salary       Age  Seniority
0  Serife  100.000000 -0.570339  -0.584518
1   Zehra   -0.579582  0.043524   0.502001
2    Ufuk   -0.750240  0.008483   0.612477
3    Umut    0.671988  1.364060   2.178631

In [46]:
reset_frame = new_df.reset_index()

In [47]:
reset_frame

    index      Salary       Age  Seniority
0  Serife  100.000000 -0.570339  -0.584518
1   Zehra   -0.579582  0.043524   0.502001
2    Ufuk   -0.750240  0.008483   0.612477
3    Umut    0.671988  1.364060   2.178631

In [48]:
reset_frame.loc[0]

index          Serife
Salary          100.0
Age         -0.570339
Seniority   -0.584518
Name: 0, dtype: object

In [50]:
new_indices = ["Sero","Zehr","Ufu","Umud"]

In [51]:
new_df["NewIndex"] = new_indices

In [52]:
new_df

            Salary       Age  Seniority NewIndex
Serife  100.000000 -0.570339  -0.584518     Sero
Zehra    -0.579582  0.043524   0.502001     Zehr
Ufuk     -0.750240  0.008483   0.612477      Ufu
Umut      0.671988  1.364060   2.178631     Umud

In [53]:
new_df.set_index("NewIndex", inplace=True)

In [54]:
new_df

              Salary       Age  Seniority
NewIndex
Sero      100.000000 -0.570339  -0.584518
Zehr       -0.579582  0.043524   0.502001
Ufu        -0.750240  0.008483   0.612477
Umud        0.671988  1.364060   2.178631

In [55]:
new_df.loc["Sero"]

Salary       100.000000
Age           -0.570339
Seniority     -0.584518
Name: Sero, dtype: float64

In [56]:
# multi index

In [57]:
first_index = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [58]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [59]:
zipped_index = list(zip(first_index,inner_index))

In [60]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [61]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [62]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [63]:
sample_values = np.ones((6,2))

In [64]:
big_df = pd.DataFrame(sample_values,index = zipped_index, columns = ["Age","Salary"])

In [65]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [66]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [67]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [ ]:
big_df.loc["Simpson"].lo